{
    "title": "LocalTuyaIR Remote Control",
    "config": {
        "abort": {
            "already_configured": "Error: integration for this device is already configured.",
            "unknown": "Unknown error, please check logs."
        },
        "error": {
            "cannot_connect": "Cannot connect to the device. Verify that address, device id, local key and protocol version are correct.",
            "no_control_type": "Can't detect control type. Maybe the device is not supported, sorry.",
            "tuya_not_found": "No Tuya devices found. Make sure that it's online and connected to the same network and try again.",
            "cloud_error": "Error while connecting to the Tuya cloud. Please check your configuration.",
            "cloud_unauthorized": "Unauthorized to access the Tuya cloud. Please check your configuration: API key and API secret.",
            "cloud_no_devices": "No Tuya devices found in the cloud. Please check your configuration, make sure that you linked the correct account and selected the correct region.",
            "unknown": "Unknown error, please check logs."
        },
        "step": {
            "method": {
                "title": "LocalTuyaIR Remote Control",
                "description": "This integration will allow you use your Tuya universal remote control device with Home Assistant locally, without the need for the Tuya cloud.\n\nTo access your Tuya Remote Control device, we need to know its local encryption key. This step can be a bit tricky, so please see the documentation for more information.\n\nPlease select the method you want to use to configure your Tuya Remote Control device.",
                "menu_options": {
                    "cloud": "Obtain the local key using the Tuya Cloud API",
                    "ip_method": "Enter the local key manually"
                }
            },
            "cloud": {
                "title": "Tuya Cloud API",
                "description": "To obtain the local key, we need to connect to the Tuya cloud. Please enter your Tuya Cloud API Client ID and Client Secret. Check the documentation for more information.",
                "data": {
                    "region": "Region",
                    "client_id": "Client ID",
                    "client_secret": "Client Secret"
                }
            },
            "ip_method": {
                "title": "How to obtain the device IP address",
                "description": "To obtain the device IP address, you can either scan your local network or enter it manually.",                
                "menu_options": {
                    "pre_scan": "Scan the local network (recommended)",
                    "ask_ip": "Enter the IP address manually",
                    "config": "Enter the IP address manually"
                }
            },
            "ask_ip": {
                "title": "Enter the device IP address",
                "description": "Please enter the IP address of your Tuya Remote Control device and select the corresponding device from the Tuya cloud.",
                "data": {
                    "host": "Device IP address",
                    "device_id": "Device name"
                }
            },
            "pre_scan": {
                "title": "Network scan",
                "description": "Now we need to find your device on the network. It can take up to 30 seconds."
            },
            "scan": {
                "title": "Select device",
                "description": "Please select the IP address of your Tuya Remote Control device.",
                "data": {
                    "host": "Device IP address"
                }
            },
            "config": {
                "title": "Configure your Tuya Remote Control device",
                "description": "Please enter the IP address, device ID and local key of your Tuya Remote Control device.",
                "data": {
                    "name": "Device name",
                    "host": "Host",
                    "device_id": "Device ID",
                    "local_key": "Local key",
                    "protocol_version": "Protocol version (usually 3.3 or 3.4)",
                    "persistent_connection": "Persistent connection (faster but can be unstable)"
                }
            }
        }
    },
    "options": {
        "step": {
            "init": {
                "title": "Configure your Tuya Remote Control device",
                "data": {
                    "persistent_connection": "Persistent connection (faster but can be unstable)"
                }
            }
        }
    }
}
