{
    "title": "LocalTuyaIR Remote Control",
    "config": {
        "abort": {
            "already_configured": "Ошибка: интеграция для этого устройства уже настроена.",
            "unknown": "Неизвестная ошибка, пожалуйста, проверьте логи."
        },
        "error": {
            "cannot_connect": "Не удаётся подключиться к устройству. Проверьте, что адрес, ID устройства, локальный ключ и версия протокола указаны верно.",
            "no_control_type": "Не удалось определить тип управления. Возможно, устройство не поддерживается.",
            "tuya_not_found": "Устройства Tuya не найдены. Убедитесь, что устройство онлайн и подключено к той же сети, затем попробуйте снова.",
            "cloud_error": "Ошибка при подключении к облаку Tuya. Проверьте вашу конфигурацию.",
            "cloud_unauthorized": "Нет доступа к облаку Tuya. Проверьте вашу конфигурацию: API key и API secret.",
            "cloud_no_devices": "В облаке не найдено устройств Tuya. Проверьте вашу конфигурацию, убедитесь, что вы связали правильный аккаунт и выбрали правильный регион.",
            "unknown": "Неизвестная ошибка, пожалуйста, проверьте логи."
        },
        "step": {
            "method": {
                "title": "LocalTuyaIR Remote Control",
                "description": "Эта интеграция позволит вам использовать ваш универсальный пульт Tuya с Home Assistant локально, без необходимости использовать облако Tuya.\n\nДля доступа к вашему устройству Tuya Remote Control нам нужен его локальный ключ шифрования. Этот шаг может быть немного сложным, пожалуйста, ознакомьтесь с документацией для получения дополнительной информации.\n\nПожалуйста, выберите способ настройки вашего устройства Tuya Remote Control.",
                "menu_options": {
                    "cloud": "Получить локальный ключ через Tuya Cloud API",
                    "ip_method": "Ввести локальный ключ вручную"
                }
            },
            "cloud": {
                "title": "Tuya Cloud API",
                "description": "Чтобы получить локальный ключ, необходимо подключиться к облаку Tuya. Пожалуйста, введите ваш Client ID и Client Secret от Tuya Cloud API. Подробнее смотрите в документации.",
                "data": {
                    "region": "Регион",
                    "client_id": "Client ID",
                    "client_secret": "Client Secret"
                }
            },
            "ip_method": {
                "title": "Как получить IP-адрес устройства",
                "description": "Чтобы получить IP-адрес устройства, вы можете просканировать вашу локальную сеть или ввести его вручную.",
                "menu_options": {
                    "pre_scan": "Сканировать локальную сеть (рекомендуется)",
                    "ask_ip": "Ввести IP-адрес вручную",
                    "config": "Ввести IP-адрес вручную"
                }
            },
            "ask_ip": {
                "title": "Введите IP-адрес устройства",
                "description": "Пожалуйста, введите IP-адрес вашего устройства Tuya Remote Control и выберите соответствующее устройство из облака Tuya.",
                "data": {
                    "host": "IP-адрес устройства",
                    "device_id": "Имя устройства"
                }
            },
            "pre_scan": {
                "title": "Сканирование сети",
                "description": "Сейчас мы ищем ваше устройство в сети. Это может занять до 30 секунд."
            },
            "scan": {
                "title": "Выберите устройство",
                "description": "Пожалуйста, выберите IP-адрес вашего устройства Tuya Remote Control.",
                "data": {
                    "host": "IP-адрес устройства"
                }
            },
            "config": {
                "title": "Настройте ваше устройство Tuya Remote Control",
                "description": "Пожалуйста, введите IP-адрес, ID устройства и локальный ключ вашего устройства Tuya Remote Control.",
                "data": {
                    "name": "Имя устройства",
                    "host": "Хост",
                    "device_id": "ID устройства",
                    "local_key": "Локальный ключ",
                    "protocol_version": "Версия протокола (обычно 3.3 or 3.4)",
                    "persistent_connection": "Постоянное соединение (быстрее, но может быть нестабильным)"
                }
            }
        }
    },
    "options": {
        "step": {
            "init": {
                "title": "Настройте ваше устройство Tuya Remote Control",
                "data": {
                    "persistent_connection": "Постоянное соединение (быстрее, но может быть нестабильным)"
                }
            }
        }
    }
}
